#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и 
#проверяет, является ли этот день выходным.

#Пример:

#- 6 -> да
#- 7 -> да
#- 1 -> нет

#print('Введите цифру, обозначающую день недели')
#a=int(input())
#if a<=5:
    #print('Не являеся выходным днем')
#else:
    #print('Является выходным днем')






#Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для
# всех значений предикат. 


def inputNumbers(x):
    xyz = ['X', 'Y', 'Z']
    a = []
    for i in range(x):
        a.append(input('Введите значение {}: '.format(xyz[i])))
    return a


def checkPredicate(x):
    left = not (x[0] or x[1] or x[2])
    right = not x[0] and not x[1] and not x[2]
    result = left == right
    return result


statement = inputNumbers(3)

if checkPredicate(statement) == True:
    print('Утверждение истинно')
else:
    print('Утверждение ложно')





#Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и
#  Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка
#  (или на какой оси она находится).


#x=int(input('Введите число х!=0:'))
#y=int(input('Введите число y!=0:'))
#a=1
#b=2
#c=3
#d=4

#if x==0:
    #print('x не может быть равно 0')
#if y==0:
    #print('y не может быть равно 0')    

#elif x>0 and y>0:
    #print('Номер четверти плоскости-{}'.format(a))
#elif x<0 and y>0:
    #('Номер четверти плоскости-{}'.format(b))
#elif x<0 and y<0:
    #print('Номер четверти плоскости-{}'.format(c))
#elif x>0 and y<0:
    #print('Номер четверти плоскости-{}'.format(d)) 





#Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных 
#координат точек в этой четверти (x и y).


#a=int(input('Введите номер четверти оси:'))
#if a==1:
    #print('Первая ось: x>0 и y>0') 
#elif a==2:
    #print('Вторая ось: х<0 и y>0')
#elif a==3:
    #print('Третья ось: x<0 и y<0') 
#elif a==4:
    #print('Четвертая ось: x>0 и y<0')
#elif a>4:
    #print('Ошибка, нет такого номера четверти оси') 





#Напишите программу, которая принимает на вход координаты двух точек и находит
#  расстояние между ними в 2D пространстве.


#ax=float(input('Введите координаты точки a по оси x:'))
#ay=float(input('Введите координаты точки a по оси y:'))

#bx=float(input('Введите координаты точки b по оси x:'))
#by=float(input('Введите координаты точки b по оси y:'))

#import math
#distans=float
#distans=(round(((ax-bx)**2+(ay-by)**2)**(0.5), 3))
#print('Расстояние между точкой a до точки b={}'.format(distans))
